ec2-galera/percona-replicate.1/add_2_1560.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            229656
        write:                           82020
        other:                           32808
        total:                           344484
    transactions:                        16404  (10.51 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 311676 (199.77 per sec.)
    other operations:                    32808  (21.03 per sec.)

Test execution summary:
    total time:                          1560.1498s
    total number of events:              16404
    total time taken by event execution: 3120.0357
    per-request statistics:
         min:                                 38.47ms
         avg:                                190.20ms
         max:                               1687.95ms
         approx.  95 percentile:             326.72ms

Threads fairness:
    events (avg/stddev):           8202.0000/25.00
    execution time (avg/stddev):   1560.0179/0.04