ec2-galera/percona-replicate.1/add_2_960.out
sysbench 0.4.12:  multi-threaded system evaluation benchmark

Running the test with following options:
Number of threads: 2

Doing OLTP test.
Running mixed OLTP test
Using Special distribution (12 iterations,  1 pct of values are returned in 75 pct cases)
Using "BEGIN" for starting transactions
Using auto_inc on the id column
Threads started!
Time limit exceeded, exiting...
(last message repeated 1 times)
Done.

OLTP test statistics:
    queries performed:
        read:                            129570
        write:                           46275
        other:                           18510
        total:                           194355
    transactions:                        9255   (9.64 per sec.)
    deadlocks:                           0      (0.00 per sec.)
    read/write requests:                 175845 (183.16 per sec.)
    other operations:                    18510  (19.28 per sec.)

Test execution summary:
    total time:                          960.0707s
    total number of events:              9255
    total time taken by event execution: 1920.0415
    per-request statistics:
         min:                                 38.28ms
         avg:                                207.46ms
         max:                               1688.56ms
         approx.  95 percentile:             345.84ms

Threads fairness:
    events (avg/stddev):           4627.5000/10.50
    execution time (avg/stddev):   960.0207/0.00